CSI API ETABS v1
cDetailing.GetNumberDetailedSlabs Method
 Retrieves number of Detailed outputs for Slab
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNumberDetailedSlabs(
	ref int NumberDetailingOutput
)
Function GetNumberDetailedSlabs (
	ByRef NumberDetailingOutput As Integer
) As Integer
Dim instance As cDetailing
Dim NumberDetailingOutput As Integer
Dim returnValue As Integer
returnValue = instance.GetNumberDetailedSlabs(NumberDetailingOutput)
int GetNumberDetailedSlabs(
	int% NumberDetailingOutput
)
abstract GetNumberDetailedSlabs :
        NumberDetailingOutput : int byref -> int
Parameters
NumberDetailingOutput
Type: System.Int32
 Number of detailed outputs present in model. One output for each story.
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace